#+TITLE: Syllabus for  06-623 Mathematical Modeling of Chemical Engineering Processes
#+AUTHOR: John Kitchin
#+DATE: Fall 2019
#+options: toc:nil

** Grading

Each assignment will be in one of these categories. Your final grade will be determined by the weighted sum of all your grades.

#+BEGIN_SRC python :results raw
import json
import numpy as np
from pycse.orgmode import *

with open('f19-06623.json') as f:
    data = json.loads(f.read())

categories = [['Category', 'weight'], None]
categories += zip(*data['categories'])
categories += [None]
categories += [['Total', sum(data['categories'][1])]]

table(categories,
      name='categories', caption='Categories and weights for graded assignments.')
#+END_SRC

#+RESULTS:
#+caption: Categories and weights for graded assignments.
#+name: categories
| Category   | weight |
|------------+--------|
| homework   |    0.1 |
| quiz       |   0.25 |
| exam-1     |   0.15 |
| exam-2     |    0.2 |
| final-exam |    0.3 |
|------------+--------|
| Total      |    1.0 |


Each assignment will receive two grades, one for the technical work, and one for the presentation. The technical aspect counts for 90% of the total grade, and the presentation accounts for 10% of the total grade.

Homeworks will be assigned one to three times a week. Each assignment will typically be one problem that should take 30-90 minutes to complete.

Quizzes will be given in class. You should be prepared to take a quiz at any time. These will typically be short, timed problems.

Exams will be given during class, and you must be present in class for them.

You should bring your computer to class every day. You will need it to follow the lecture notes, to participate in class exercises, and to complete quizzes and exams. You are responsible for ensuring the battery is charged, that you can connect to the internet, and that the software required for the course is installed and working. There will not be any makeup assignments.

